# StructuralAnalyticalModel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalModel Property
ParameterTypeId Class See Also
---
"Enable Analytical Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalModel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace